www/doc/got-plt.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Что такое @PLT</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Что такое @PLT</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4e3354d">И как libc линкуется в рантайме?</a>
<ul>
<li><a href="#org5cdeb83">ASLR</a></li>
</ul>
</li>
<li><a href="#org7a90340">Загрузка динамических библиотек</a>
<ul>
<li><a href="#orgb2ac5df">GOT</a></li>
<li><a href="#org3145dde">PLT</a></li>
<li><a href="#org78807bf">Как все это работает?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
+STARTUP: showall indent hidestars
</p>

<div id="outline-container-org4e3354d" class="outline-2">
<h2 id="org4e3354d">И как libc линкуется в рантайме?</h2>
<div class="outline-text-2" id="text-org4e3354d">
<p>
Каждый, кто своим любопытным отладчиком смотрел в собственноручно собранный helloworld,
замечал там, неожиданную строчку:
</p>

<div class="org-src-container">
<pre class="src src-sh">0x000000000040c04b6 &lt;main+30&gt;:   callq  0x400398 &lt;printf@plt&gt;
</pre>
</div>

<p>
и удивлялся тому, что его привычный и знакомый <code>printf</code> обрел какой-то странный и
непонятный суффикс <code>@plt</code>. Посмотрим, почему это произошло.
</p>
</div>

<div id="outline-container-org5cdeb83" class="outline-3">
<h3 id="org5cdeb83">ASLR</h3>
<div class="outline-text-3" id="text-org5cdeb83">
<p>
Сравнительно недавно динамические разделяемые библиотеки загружались в адресное
пространство целевого процесса по стандартным, одинаковым для всех процессов, адресам,
зависящим, разве что от версии операционной системы. Это весьма облегчало жизнь разного
рода вредоносным программам, потому что они могли с некоторой долей уверенности
предполагать расположение нужных им функций операционной системы, например для открытия
и записи в файлы, чтобы заразить другие программы.
</p>

<p>
Поэтому через некоторое время была придумана и внедрена рандомизация размещения
адресного пространства (address space layout randomization - ASLR). И теперь программам
заранее неизвестны адреса вызовов библиотечных функций, когда библиотеки линкуются
динамически.
</p>
</div>
</div>
</div>

<div id="outline-container-org7a90340" class="outline-2">
<h2 id="org7a90340">Загрузка динамических библиотек</h2>
<div class="outline-text-2" id="text-org7a90340">
<p>
Итак, если код разделяемой библиотеки загружен неведомо куда, то как же программе его
вызывать? Для этого придумали GOT и PLT.
</p>
</div>

<div id="outline-container-orgb2ac5df" class="outline-3">
<h3 id="orgb2ac5df">GOT</h3>
<div class="outline-text-3" id="text-orgb2ac5df">
<p>
Каждый исполняемый ELF-файл имеет раздел, называемый <code>глобальной таблицей смещений</code>
(Global Offset Table, GOT). Эта таблица получает значения абсолютных адресов функций во
время выполнения.
</p>

<p>
Мы можем взглянуть на нее:
</p>

<div class="org-src-container">
<pre class="src src-sh">rigidus@machine:~$ objdump -R ./hello_world

./hello_world:     file format elf32-i386

DYNAMIC RELOCATION RECORDS
OFFSET   TYPE              VALUE
08049564 R_386_GLOB_DAT    __gmon_start__
08049574 R_386_JUMP_SLOT   __gmon_start__
08049578 R_386_JUMP_SLOT   __libc_start_main
0804957c R_386_JUMP_SLOT   printf
</pre>
</div>
</div>
</div>

<div id="outline-container-org3145dde" class="outline-3">
<h3 id="org3145dde">PLT</h3>
<div class="outline-text-3" id="text-org3145dde">
<p>
Также каждый исполняемый файл имеет секцию, называемую <code>таблицей связей процедур</code>
(Procedure Linkage Table, PLT). Когда вы читаете дизассемблированный код, вы видите,
что вызовы функций, такие как <code>printf</code> указывают именно туда.
</p>

<p>
Если взглянуть внимательнее в эту секцию, то можно увидеть короткие однотипны цепочки
инструкций:
</p>

<div class="org-src-container">
<pre class="src src-sh">rigidus@machine:~$ objdump -d -j .plt ./hello_world

./hello_world:     file format elf32-i386

Disassembly of section .plt:

08048270 &lt;__gmon_start__@plt-0x10&gt;:
8048270:       ff 35 6c 95 04 08       pushl  0x804956c
8048276:       ff 25 70 95 04 08       jmp    *0x8049570
804827c:       00 00                   add    %al,(%eax)

08048280 &lt;__gmon_start__@plt&gt;:
8048280:       ff 25 74 95 04 08       jmp    *0x8049574
8048286:       68 00 00 00 00          push   $0x0
804828b:       e9 e0 ff ff ff          jmp    8048270 &lt;_init+0x18&gt;

08048290 &lt;__libc_start_main@plt&gt;:
8048290:       ff 25 78 95 04 08       jmp    *0x8049578
8048296:       68 08 00 00 00          push   $0x8
804829b:       e9 d0 ff ff ff          jmp    8048270 &lt;_init+0x18&gt;

080482a0 &lt;printf@plt&gt;:
80482a0:       ff 25 7c 95 04 08       jmp    *0x804957c
80482a6:       68 10 00 00 00          push   $0x10
80482ab:       e9 c0 ff ff ff          jmp    8048270 &lt;_init+0x18&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org78807bf" class="outline-3">
<h3 id="org78807bf">Как все это работает?</h3>
<div class="outline-text-3" id="text-org78807bf">
<p>
Перейдем к первому вызову <code>printf@plt</code>, который на самом деле не <code>printf</code> а jmp на
соответствующее место в PLT:
</p>

<div class="org-src-container">
<pre class="src src-sh">080482a0 &lt;printf@plt&gt;:
80482a0:       ff 25 7c 95 04 08       jmp    *0x804957c
80482a6:       68 10 00 00 00          push   $0x10
80482ab:       e9 c0 ff ff ff          jmp    8048270 &lt;_init+0x18&gt;
</pre>
</div>

<p>
Обратите внимание, что это коссвенный переход по указателю <code>0x804957c</code>, который
находится в GOT. GOT в конечном итоге будет иметь абсолютный адрес для <code>printf</code>, однако
при первом вызове произойдет возврат к инструкции после перехода в PLT -
<code>0x80482a6</code>. Мы можем увидеть это ниже:
</p>

<div class="org-src-container">
<pre class="src src-sh">(gdb) x/8x 0x804957c-20
0x8049568 &lt;_GLOBAL_OFFSET_TABLE_&gt;:      0x0804949c      0xb80016e0      0xb7ff92f0      0x08048286
0x8049578 &lt;_GLOBAL_OFFSET_TABLE_+16&gt;:   0xb7eafde0      0x080482a6      0x00000000      0x00000000
</pre>
</div>

<p>
В коде внутри PLT смещение кладется в стек и выполняется другой jmp:
</p>

<div class="org-src-container">
<pre class="src src-sh">080482a0 &lt;printf@plt&gt;:
80482a0:       ff 25 7c 95 04 08       jmp    *0x804957c
80482a6:       68 10 00 00 00          push   $0x10
80482ab:       e9 c0 ff ff ff          jmp    8048270 &lt;_init+0x18&gt;
</pre>
</div>

<p>
Этот переход - это переход к возможному компоновщику времени выполнения, который будет
загружать разделяемую библиотеку, которая содержит printf. Смещение <code>$0x10</code>, которое
было положено в стек, сообщает этому компоновщику код смещения символа в GOT (см. вывод
<code>objdump -R ./hello_world</code> выше), printf в этом случае. Затем компоновщик будет
записывать адрес printf в GOT по адресу <code>0x804957c</code>. Мы можем увидеть это, если
посмотрим на GOT после загрузки библиотеки:
</p>

<div class="org-src-container">
<pre class="src src-sh">(gdb) x/8x 0x804957c-20
0x8049568 &lt;_GLOBAL_OFFSET_TABLE_&gt;:      0x0804949c      0xb80016e0      0xb7ff92f0      0x08048286
0x8049578 &lt;_GLOBAL_OFFSET_TABLE_+16&gt;:   0xb7eafde0      0xb7edf620      0x00000000      0x00000000
</pre>
</div>

<p>
Обратите внимание, что предыдущий адрес, <code>0x80482a6</code>, был заменен компоновщиком на
<code>0xb7edf620</code>. Чтобы подтвердить, что это действительно адрес для printf, мы можем
начать дизассемблировать по этому адресу:
</p>

<div class="org-src-container">
<pre class="src src-sh">(gdb) disassemble 0xb7edf620
Dump of assembler code for function printf:
...
</pre>
</div>

<p>
Поскольку библиотека теперь загружена и GOT был перезаписан абсолютным адресом для
printf, последующие вызовы функции printf@plt перейдут непосредственно к адресу printf.
</p>

<p>
Все это также имеет дополнительное преимущество в том, что общая библиотека не
загружается до загрузки функции в ее библиотеку - другими словами, это "ленивая
загрузка".
</p>
</div>
</div>
</div>
</div>
</body>
</html>
